* and more like vlan and bridge
  
#+BEGIN_SRC emacs-lisp
(setf bonding '(nic1 nic2))
(cons (cons bonding 'vlan) 'bridge)
#+END_SRC

#+RESULTS:
: (((nic1 nic2) . vlan) . bridge)

* ip alias
* bonding

- /proc/net/bond/bond0

* type of bond

- active standby
- active active support by switch

** active active support by switch

*** support by cisco
*** support by juniper
* bonding then teaming
* DONE vlan

- /proc/net/vlan/config
- vi /etc/sysconfig/network-scripts/ifcfg-eth0.5
- DEVICE=eth0.5
- VLAN=yes

** using file

#+BEGIN_SRC 
# cat ifcfg-p1p1
DEVICE=p1p1
TYPE=Ethernet
BOOTPROTO=none
ONBOOT=yes
#+END_SRC

#+BEGIN_SRC 
# cat ifcfg-p1p1.101 
DEVICE=p1p1.101
BOOTPROTO=none
ONBOOT=yes
IPADDR=172.16.0.184
PREFIX=24
VLAN=yes
#+END_SRC

** using ip cli

#+BEGIN_SRC 
# ip link add link eth0 name eth0.5 type vlan id 5
# ip link
# ip -d link show eth0.5
#+END_SRC

#+BEGIN_SRC 
# ip addr add 192.168.1.200/24 brd 192.168.1.255 dev eth0.5
# ip link set dev eth0.5 up
#+END_SRC

#+BEGIN_SRC 
# ip link set dev eth0.5 down
# ip link delete eth0.5
#+END_SRC

* more, USERCTL=no
* more, vconfig

- yum install epel-release
- yum install vconfig
- apt install vlan

* more, NM_CONTROLLED="no"

- systemctl disable NetworkManager

#+BEGIN_SRC 
# nmcli 
Error: NetworkManager is not running.
#+END_SRC

* more, disable ipv6

** /etc/sysconfig/network-scripts/ifcfg-eth0

IPV6INIT=no
IPV6_AUTOCONF=no

** /etc/sysconfig/network

NETWORKING_IPV6=no
IPV6_AUTOCONF=no

